ams2016/README/README.tex
% Created 2015-12-07 Mon 16:01
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Julien Chastang}
\date{\textit{<2015-12-07 Mon>}}
\title{AMS 2016: UniCloud}
\hypersetup{
 pdfauthor={Julien Chastang},
 pdftitle={AMS 2016: UniCloud},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section*{Microsoft Azure VM with LDM, TDS, and RAMADDA}
\label{sec:orgheadline17}

\subsection*{Preamble}
\label{sec:orgheadline1}

The following instructions describe how to configure a Microsoft Azure VM serving data with the \href{http://www.unidata.ucar.edu/software/ldm/}{LDM}, \href{http://www.unidata.ucar.edu/software/thredds/current/tds/}{TDS}, and \href{http://sourceforge.net/projects/ramadda/}{RAMADDA}. This document assumes you have access to Azure resources though these instructions should be fairly similar on other cloud providers. They also assume familiarity with Unix, Docker, and Unidata technology in general. We will be using Docker images defined here:

\url{https://github.com/Unidata/Unidata-Dockerfiles}

in addition to a configuration specifically planned for AMS 2016 demonstrations here:

\url{https://github.com/Unidata/Unidata-Dockerfiles/tree/master/ams2016}
