ams2016/README/README.org
**  Preliminary Setup on Azure (Mostly Docker)

For these instructions, we will decide on the name of an Azure VM; =unidata-server.cloudapp.net= abbreviated to =unidata-server=.

We will now create a VM on Azure.

On your local machine you will want to set up an Azure VM with a =docker-machine= command that will look something like the command below. See [[https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-docker-machine/][here]] for more information on using =docker-machine= with Azure.

The following command will take a while to run (between 5 and 10 minutes). You will have to supply =azure-subscription-id= and =azure-subscription-cert= path provided by Azure. Again see [[https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-docker-machine/][here]] if you have questions.

# Don't execute the following code block in this buffer; it will take too long. Instead =org-babel-tangle= with a prefix argument; C-u C-c C-v t. Then execute from the command line =/tmp/azure.sh=.

#+BEGIN_SRC org :dir ~ :noweb tangle :tangle /tmp/azure.sh  :exports none :eval no
docker-machine -D create -d azure \
               --azure-subscription-id="3.141" \
               --azure-subscription-cert="/path/to/mycert.pem" \
               --azure-size="ExtraLarge" <<myvm>>
#+END_SRC

#+INCLUDE: "/tmp/azure.sh" src org 

Set up your environment to interact with your new Azure VM.

#+BEGIN_SRC sh :dir ~ :results silent :noweb yes
  eval "$(docker-machine env <<myvm>>)"
#+END_SRC

=ssh= into your new host with =docker-machine=

#+BEGIN_SRC sh :eval no :noweb yes
  docker-machine ssh <<myvm>>
#+END_SRC

# You are about to start running remote execution commands on the Azure VM via tramp. Make sure you can ssh into the VM from the command line to diagnose any potential problems. Also don't forget to tramp clean up connections, if there are problems.

You will need to install one or more Unix utilities:

#+BEGIN_SRC sh  :results verbatim drawer :exports code
  sudo apt-get -qq update
  sudo apt-get -qq install unzip
#+END_SRC

Add the =ubuntu= user to the =docker= group.

#+BEGIN_SRC sh :results verbatim drawer :exports code
  sudo usermod -G docker ubuntu
  sudo service docker restart
#+END_SRC

#+RESULTS:
:RESULTS:
docker stop/waiting
docker start/running, process 29917
:END:

At this point, we want to restart the VM to get a fresh start. This may take a little while....

#+BEGIN_SRC sh :dir ~ :noweb yes :results verbatim drawer :exports code
  docker-machine restart <<myvm>>
  eval "$(docker-machine env <<myvm>>)"
#+END_SRC

#+RESULTS:
:RESULTS:
Restarted machines may have new IP addresses. You may need to re-run the `docker-machine env` command.
:END:

#+BEGIN_SRC sh :dir ~ :eval no :noweb yes
  docker-machine ssh <<myvm>>
#+END_SRC

#+BEGIN_SRC org :noweb-ref dcompose-version :exports none
1.5.2
#+END_SRC

#+BEGIN_SRC emacs-lisp :noweb yes :results raw :exports results
  (format "Next install =docker-compose=. You may have to update version (currently at =<<dcompose-version>>=).")
#+END_SRC

#+RESULTS:
Next install =docker-compose=. You may have to update version (currently at =1.5.2=).

#+BEGIN_SRC sh :noweb yes :results verbatim drawer :exports code
  curl -L \
 https://github.com/docker/compose/releases/download/<<dcompose-version>>/docker-compose-`uname -s`-`uname -m` \
       > docker-compose
  sudo mv docker-compose /usr/local/bin/
  sudo chmod +x /usr/local/bin/docker-compose
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

** LDM and TDS Configuration

Clone =Unidata-Dockerfiles= and =TdsConfig= repositories:

#+BEGIN_SRC sh :results silent
  mkdir -p /home/ubuntu/git
  git clone https://github.com/Unidata/Unidata-Dockerfiles /home/ubuntu/git/Unidata-Dockerfiles
  git clone https://github.com/Unidata/TdsConfig /home/ubuntu/git/TdsConfig
#+END_SRC

Create some directories for the LDM, basically the familiar =etc=, =var=, =var/log=.

#+BEGIN_SRC sh  :results silent
  mkdir -p ~/var/logs 
  mkdir -p ~/etc/TDS
#+END_SRC

Now copy all files in =~/git/Unidata-Dockerfiles/ldm/etc/= into the =~/etc= directory from the =Unidata-Dockerfiles= repositories. Note that some of these files will be modified or overwritten shortly.

- =ldmd.conf=
- =registry.xml=
- =pqact.conf=
- =scour.conf=
- =netcheck.conf=

#+BEGIN_SRC sh :results silent :exports code
  cp ~/git/Unidata-Dockerfiles/ldm/etc/* ~/etc
#+END_SRC

Now we are going to replace =ldmd.conf=, =registry.xml=, =scour.conf= from the =~/git/Unidata-Dockerfiles/ams2016= dir into =~/etc=.

*** Ask for Unidata (or Someone to Feed You Data Via the LDM)

The LDM operates on a push data model. You will have to find someone who will agree to push you the data. If you are part of the American academic community please send a support email to support-idd@unidata.ucar.edu.

