ams2016/README/README.tex

\subsection*{Preliminary Setup on Azure (Mostly Docker)}
\label{sec:orgheadline2}

For these instructions, we will decide on the name of an Azure VM; \texttt{unidata-server.cloudapp.net} abbreviated to \texttt{unidata-server}.

We will now create a VM on Azure.

On your local machine you will want to set up an Azure VM with a \texttt{docker-machine} command that will look something like the command below. See \href{https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-docker-machine/}{here} for more information on using \texttt{docker-machine} with Azure.

The following command will take a while to run (between 5 and 10 minutes). You will have to supply \texttt{azure-subscription-id} and \texttt{azure-subscription-cert} path provided by Azure. Again see \href{https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-docker-machine/}{here} if you have questions.


\begin{verbatim}
docker-machine -D create -d azure \
               --azure-subscription-id="3.141" \
               --azure-subscription-cert="/path/to/mycert.pem" \
               --azure-size="ExtraLarge" unidata-server
\end{verbatim}

Set up your environment to interact with your new Azure VM.

\begin{verbatim}
eval "$(docker-machine env unidata-server)"
\end{verbatim}

\texttt{ssh} into your new host with \texttt{docker-machine}

\begin{verbatim}
docker-machine ssh unidata-server
\end{verbatim}


You will need to install one or more Unix utilities:

\begin{verbatim}
sudo apt-get -qq update
sudo apt-get -qq install unzip
\end{verbatim}

Add the \texttt{ubuntu} user to the \texttt{docker} group.

\begin{verbatim}
sudo usermod -G docker ubuntu
sudo service docker restart
\end{verbatim}

At this point, we want to restart the VM to get a fresh start. This may take a little while\ldots{}.

\begin{verbatim}
docker-machine restart unidata-server
eval "$(docker-machine env unidata-server)"
\end{verbatim}

\begin{verbatim}
docker-machine ssh unidata-server
\end{verbatim}

Next install \texttt{docker-compose}. You may have to update version (currently at \texttt{1.5.2}).

\begin{verbatim}
 curl -L \
https://github.com/docker/compose/releases/download/1.5.2/docker-compose-`uname -s`-`uname -m` \
      > docker-compose
 sudo mv docker-compose /usr/local/bin/
 sudo chmod +x /usr/local/bin/docker-compose
\end{verbatim}

\subsection*{LDM and TDS Configuration}
\label{sec:orgheadline9}

Clone \texttt{Unidata-Dockerfiles} and \texttt{TdsConfig} repositories:

\begin{verbatim}
mkdir -p /home/ubuntu/git
git clone https://github.com/Unidata/Unidata-Dockerfiles /home/ubuntu/git/Unidata-Dockerfiles
git clone https://github.com/Unidata/TdsConfig /home/ubuntu/git/TdsConfig
\end{verbatim}

Create some directories for the LDM, basically the familiar \texttt{etc}, \texttt{var}, \texttt{var/log}.

\begin{verbatim}
mkdir -p ~/var/logs 
mkdir -p ~/etc/TDS
\end{verbatim}

Now copy all files in \texttt{\textasciitilde{}/git/Unidata-Dockerfiles/ldm/etc/} into the \texttt{\textasciitilde{}/etc} directory from the \texttt{Unidata-Dockerfiles} repositories. Note that some of these files will be modified or overwritten shortly.

\begin{itemize}
\item \texttt{ldmd.conf}
\item \texttt{registry.xml}
\item \texttt{pqact.conf}
\item \texttt{scour.conf}
\item \texttt{netcheck.conf}
\end{itemize}

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ldm/etc/* ~/etc
\end{verbatim}

Now we are going to replace \texttt{ldmd.conf}, \texttt{registry.xml}, \texttt{scour.conf} from the \texttt{\textasciitilde{}/git/Unidata-Dockerfiles/ams2016} dir into \texttt{\textasciitilde{}/etc}.

\subsubsection*{Ask for Unidata (or Someone to Feed You Data Via the LDM)}
\label{sec:orgheadline3}

The LDM operates on a push data model. You will have to find someone who will agree to push you the data. If you are part of the American academic community please send a support email to support-idd@unidata.ucar.edu.
