ams2016/README/README.md

## Preliminary Setup on Azure (Mostly Docker)<a id="orgheadline2"></a>

For these instructions, we will decide on the name of an Azure VM; `unidata-server.cloudapp.net` abbreviated to `unidata-server`.

We will now create a VM on Azure.

On your local machine you will want to set up an Azure VM with a `docker-machine` command that will look something like the command below. See [here](https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-docker-machine/) for more information on using `docker-machine` with Azure.

The following command will take a while to run (between 5 and 10 minutes). You will have to supply `azure-subscription-id` and `azure-subscription-cert` path provided by Azure. Again see [here](https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-docker-machine/) if you have questions.

    docker-machine -D create -d azure \
                   --azure-subscription-id="3.141" \
                   --azure-subscription-cert="/path/to/mycert.pem" \
                   --azure-size="ExtraLarge" unidata-server

Set up your environment to interact with your new Azure VM.

    eval "$(docker-machine env unidata-server)"

`ssh` into your new host with `docker-machine`

    docker-machine ssh unidata-server

You will need to install one or more Unix utilities:

    sudo apt-get -qq update
    sudo apt-get -qq install unzip

Add the `ubuntu` user to the `docker` group.

    sudo usermod -G docker ubuntu
    sudo service docker restart

At this point, we want to restart the VM to get a fresh start. This may take a little while&#x2026;.

    docker-machine restart unidata-server
    eval "$(docker-machine env unidata-server)"

    docker-machine ssh unidata-server

Next install `docker-compose`. You may have to update version (currently at `1.5.2`).

     curl -L \
    https://github.com/docker/compose/releases/download/1.5.2/docker-compose-`uname -s`-`uname -m` \
          > docker-compose
     sudo mv docker-compose /usr/local/bin/
     sudo chmod +x /usr/local/bin/docker-compose

## LDM and TDS Configuration<a id="orgheadline9"></a>

Clone `Unidata-Dockerfiles` and `TdsConfig` repositories:

    mkdir -p /home/ubuntu/git
    git clone https://github.com/Unidata/Unidata-Dockerfiles /home/ubuntu/git/Unidata-Dockerfiles
    git clone https://github.com/Unidata/TdsConfig /home/ubuntu/git/TdsConfig

Create some directories for the LDM, basically the familiar `etc`, `var`, `var/log`.

    mkdir -p ~/var/logs 
    mkdir -p ~/etc/TDS

Now copy all files in `~/git/Unidata-Dockerfiles/ldm/etc/` into the `~/etc` directory from the `Unidata-Dockerfiles` repositories. Note that some of these files will be modified or overwritten shortly.

-   `ldmd.conf`
-   `registry.xml`
-   `pqact.conf`
-   `scour.conf`
-   `netcheck.conf`

    cp ~/git/Unidata-Dockerfiles/ldm/etc/* ~/etc

Now we are going to replace `ldmd.conf`, `registry.xml`, `scour.conf` from the `~/git/Unidata-Dockerfiles/ams2016` dir into `~/etc`.

### Ask for Unidata (or Someone to Feed You Data Via the LDM)<a id="orgheadline3"></a>

The LDM operates on a push data model. You will have to find someone who will agree to push you the data. If you are part of the American academic community please send a support email to support-idd@unidata.ucar.edu.
