ams2016/README/README.org
*** =ldmd.conf=

#+BEGIN_SRC sh :results silent :exports code
  cp ~/git/Unidata-Dockerfiles/ams2016/ldmd.conf ~/etc/
#+END_SRC

This =ldmd.conf= has been setup for the AMS 2016 demonstration serving the following data feeds:
 - [[http://rapidrefresh.noaa.gov/][13km Rapid Refresh]]

In addition, there is a =~/git/TdConfig/idd/pqacts/README.txt= file that may be helpful in writing a suitable =ldmd.conf= file.

*** =registry.xml=

#+BEGIN_SRC sh  :results silent :exports code
  cp ~/git/Unidata-Dockerfiles/ams2016/registry.xml ~/etc/
#+END_SRC

Make sure the =registry.xml= is edited correctly. The important element in this file is the =hostname= element. Work with support-idd@unidata.ucar.ed so that LDM stats get properly reported. It should be something like =unidata-server.azure.unidata.ucar.edu=.

#+BEGIN_SRC emacs-lisp :exports none :results silent :noweb yes
  ;; search for the buffer called registry.xml in your emacs session
  (find-file "/ubuntu@<<myvm>>:/home/ubuntu/etc/registry.xml")
#+END_SRC

*** =scour.conf=

Scouring configuration for the LDM. The crontab entry that runs scour is in the [[https://github.com/Unidata/Unidata-Dockerfiles/blob/master/ldm/crontab][LDM Docker container]]. scour is invoked once per day.

#+BEGIN_SRC sh  :results silent
  cp ~/git/Unidata-Dockerfiles/ams2016/scour.conf ~/etc/
#+END_SRC

*** =pqact.conf= and TDS configuration

Next, explode =~/git/TdsConfig/idd/config.zip= into =~/tdsconfig= and =cp -r= the =pqacts= directory into =~/etc/TDS=. *Note* do NOT use soft links. Docker does not like them.

#+BEGIN_SRC sh  :results silent
  mkdir -p ~/tdsconfig/
  cp ~/git/TdsConfig/idd/config.zip ~/tdsconfig/
  unzip ~/tdsconfig/config.zip -d ~/tdsconfig/
  cp -r ~/tdsconfig/pqacts/* ~/etc/TDS
#+END_SRC

*** =netcheck.conf=

This files remain unchanged.

** Edit TDS catalog.xml Files

The =catalog.xml= files for TDS configuration are contained with the =~/Tdsconfig= directory. Search for all files terminating in =.xml= in that directory. Edit the xml files for what data you wish to server. See the [[Http://Www.Unidata.Ucar.Edu/Software/Thredds/Current/Tds/Catalog/Index.Html][TDS Documentation]] for more information on editing these XML files.

Let's see what is available in the =~/tdsconfig= directory.

#+BEGIN_SRC sh :results org :exports both
  find ~/tdsconfig -type f -name "*.xml"
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
/home/ubuntu/tdsconfig/idd/forecastModels.xml
/home/ubuntu/tdsconfig/idd/radars.xml
/home/ubuntu/tdsconfig/idd/obsData.xml
/home/ubuntu/tdsconfig/idd/forecastProdsAndAna.xml
/home/ubuntu/tdsconfig/idd/satellite.xml
/home/ubuntu/tdsconfig/radar/CS039_L2_stations.xml
/home/ubuntu/tdsconfig/radar/CS039_stations.xml
/home/ubuntu/tdsconfig/radar/RadarNexradStations.xml
/home/ubuntu/tdsconfig/radar/RadarTerminalStations.xml
/home/ubuntu/tdsconfig/radar/RadarL2Stations.xml
/home/ubuntu/tdsconfig/radar/radarCollections.xml
/home/ubuntu/tdsconfig/catalog.xml
/home/ubuntu/tdsconfig/threddsConfig.xml
/home/ubuntu/tdsconfig/wmsConfig.xml
#+END_SRC

