ams2016/README/README.tex

\subsubsection*{\texttt{ldmd.conf}}
\label{sec:orgheadline4}

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ams2016/ldmd.conf ~/etc/
\end{verbatim}

This \texttt{ldmd.conf} has been setup for the AMS 2016 demonstration serving the following data feeds:
\begin{itemize}
\item \href{http://rapidrefresh.noaa.gov/}{13km Rapid Refresh}
\end{itemize}

In addition, there is a \texttt{\textasciitilde{}/git/TdConfig/idd/pqacts/README.txt} file that may be helpful in writing a suitable \texttt{ldmd.conf} file.

\subsubsection*{\texttt{registry.xml}}
\label{sec:orgheadline5}

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ams2016/registry.xml ~/etc/
\end{verbatim}

Make sure the \texttt{registry.xml} is edited correctly. The important element in this file is the \texttt{hostname} element. Work with support-idd@unidata.ucar.ed so that LDM stats get properly reported. It should be something like \texttt{unidata-server.azure.unidata.ucar.edu}.

\subsubsection*{\texttt{scour.conf}}
\label{sec:orgheadline6}

Scouring configuration for the LDM. The crontab entry that runs scour is in the \href{https://github.com/Unidata/Unidata-Dockerfiles/blob/master/ldm/crontab}{LDM Docker container}. scour is invoked once per day.

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ams2016/scour.conf ~/etc/
\end{verbatim}

\subsubsection*{\texttt{pqact.conf} and TDS configuration}
\label{sec:orgheadline7}

Next, explode \texttt{\textasciitilde{}/git/TdsConfig/idd/config.zip} into \texttt{\textasciitilde{}/tdsconfig} and \texttt{cp -r} the \texttt{pqacts} directory into \texttt{\textasciitilde{}/etc/TDS}. \textbf{Note} do NOT use soft links. Docker does not like them.

\begin{verbatim}
mkdir -p ~/tdsconfig/
cp ~/git/TdsConfig/idd/config.zip ~/tdsconfig/
unzip ~/tdsconfig/config.zip -d ~/tdsconfig/
cp -r ~/tdsconfig/pqacts/* ~/etc/TDS
\end{verbatim}

\subsubsection*{\texttt{netcheck.conf}}
\label{sec:orgheadline8}

This files remain unchanged.

\subsection*{Edit TDS catalog.xml Files}
\label{sec:orgheadline10}

The \texttt{catalog.xml} files for TDS configuration are contained with the \texttt{\textasciitilde{}/Tdsconfig} directory. Search for all files terminating in \texttt{.xml} in that directory. Edit the xml files for what data you wish to server. See the \href{//Www.Unidata.Ucar.Edu/Software/Thredds/Current/Tds/Catalog/Index.Html}{TDS Documentation} for more information on editing these XML files.

Let's see what is available in the \texttt{\textasciitilde{}/tdsconfig} directory.

\begin{verbatim}
find ~/tdsconfig -type f -name "*.xml"
\end{verbatim}

\begin{verbatim}
/home/ubuntu/tdsconfig/idd/forecastModels.xml
/home/ubuntu/tdsconfig/idd/radars.xml
/home/ubuntu/tdsconfig/idd/obsData.xml
/home/ubuntu/tdsconfig/idd/forecastProdsAndAna.xml
/home/ubuntu/tdsconfig/idd/satellite.xml
/home/ubuntu/tdsconfig/radar/CS039_L2_stations.xml
/home/ubuntu/tdsconfig/radar/CS039_stations.xml
/home/ubuntu/tdsconfig/radar/RadarNexradStations.xml
/home/ubuntu/tdsconfig/radar/RadarTerminalStations.xml
/home/ubuntu/tdsconfig/radar/RadarL2Stations.xml
/home/ubuntu/tdsconfig/radar/radarCollections.xml
/home/ubuntu/tdsconfig/catalog.xml
/home/ubuntu/tdsconfig/threddsConfig.xml
/home/ubuntu/tdsconfig/wmsConfig.xml
\end{verbatim}
