ams2016/README/README.md

### `ldmd.conf`<a id="orgheadline4"></a>

    cp ~/git/Unidata-Dockerfiles/ams2016/ldmd.conf ~/etc/

This `ldmd.conf` has been setup for the AMS 2016 demonstration serving the following data feeds:

-   [13km Rapid Refresh](http://rapidrefresh.noaa.gov/)

In addition, there is a `~/git/TdConfig/idd/pqacts/README.txt` file that may be helpful in writing a suitable `ldmd.conf` file.

### `registry.xml`<a id="orgheadline5"></a>

    cp ~/git/Unidata-Dockerfiles/ams2016/registry.xml ~/etc/

Make sure the `registry.xml` is edited correctly. The important element in this file is the `hostname` element. Work with support-idd@unidata.ucar.ed so that LDM stats get properly reported. It should be something like `unidata-server.azure.unidata.ucar.edu`.

### `scour.conf`<a id="orgheadline6"></a>

Scouring configuration for the LDM. The crontab entry that runs scour is in the [LDM Docker container](https://github.com/Unidata/Unidata-Dockerfiles/blob/master/ldm/crontab). scour is invoked once per day.

    cp ~/git/Unidata-Dockerfiles/ams2016/scour.conf ~/etc/

### `pqact.conf` and TDS configuration<a id="orgheadline7"></a>

Next, explode `~/git/TdsConfig/idd/config.zip` into `~/tdsconfig` and `cp -r` the `pqacts` directory into `~/etc/TDS`. **Note** do NOT use soft links. Docker does not like them.

    mkdir -p ~/tdsconfig/
    cp ~/git/TdsConfig/idd/config.zip ~/tdsconfig/
    unzip ~/tdsconfig/config.zip -d ~/tdsconfig/
    cp -r ~/tdsconfig/pqacts/* ~/etc/TDS

### `netcheck.conf`<a id="orgheadline8"></a>

This files remain unchanged.

## Edit TDS catalog.xml Files<a id="orgheadline10"></a>

The `catalog.xml` files for TDS configuration are contained with the `~/Tdsconfig` directory. Search for all files terminating in `.xml` in that directory. Edit the xml files for what data you wish to server. See the [TDS Documentation](//Www.Unidata.Ucar.Edu/Software/Thredds/Current/Tds/Catalog/Index.Html) for more information on editing these XML files.

Let's see what is available in the `~/tdsconfig` directory.

    find ~/tdsconfig -type f -name "*.xml"

    /home/ubuntu/tdsconfig/idd/forecastModels.xml
    /home/ubuntu/tdsconfig/idd/radars.xml
    /home/ubuntu/tdsconfig/idd/obsData.xml
    /home/ubuntu/tdsconfig/idd/forecastProdsAndAna.xml
    /home/ubuntu/tdsconfig/idd/satellite.xml
    /home/ubuntu/tdsconfig/radar/CS039_L2_stations.xml
    /home/ubuntu/tdsconfig/radar/CS039_stations.xml
    /home/ubuntu/tdsconfig/radar/RadarNexradStations.xml
    /home/ubuntu/tdsconfig/radar/RadarTerminalStations.xml
    /home/ubuntu/tdsconfig/radar/RadarL2Stations.xml
    /home/ubuntu/tdsconfig/radar/radarCollections.xml
    /home/ubuntu/tdsconfig/catalog.xml
    /home/ubuntu/tdsconfig/threddsConfig.xml
    /home/ubuntu/tdsconfig/wmsConfig.xml
