ams2016/README/README.org
** Setting up the Data Volumes for the LDM and RAMADDA

The =/mnt= volume on Azure is a good place to store data. I do not know what kind of assurances Azure makes about the reliability of storing your data there for the long term. (I remember reading about this once, but I cannot remember where.) For the LDM this should not be too much of a problem, but for RAMADDA you may wish to be careful.
 
#+BEGIN_SRC sh :results table drawer :exports both
  df -H
#+END_SRC

#+RESULTS:
:RESULTS:
| Filesystem | Size | Used | Avail | Use% | Mounted                           | on |
| /dev/sda1  | 31G  | 1.8G | 28G   |   6% | /                                 |    |
| none       | 4.1k |    0 | 4.1k  |   0% | /sys/fs/cgroup                    |    |
| udev       | 7.4G |  13k | 7.4G  |   1% | /dev                              |    |
| tmpfs      | 1.5G | 394k | 1.5G  |   1% | /run                              |    |
| none       | 5.3M |    0 | 5.3M  |   0% | /run/lock                         |    |
| none       | 7.4G |    0 | 7.4G  |   0% | /run/shm                          |    |
| none       | 105M |    0 | 105M  |   0% | /run/user                         |    |
| none       | 66k  |    0 | 66k   |   0% | /etc/network/interfaces.dynamic.d |    |
| /dev/sdb1  | 640G |  73M | 607G  |   1% | /mnt                              |    |
:END:

Create a =/data= directory where the LDM and RAMADDA data will live. 

For the LDM:

#+BEGIN_SRC sh :results silent
  sudo ln -s /mnt /data
  sudo mkdir /mnt/ldm/
  sudo chown -R ubuntu:docker /data/ldm
#+END_SRC

Create a =/repository= directory where the RAMADDA data will live.

#+BEGIN_SRC sh  :results silent
  sudo mkdir /mnt/repository/
  sudo chown -R ubuntu:docker /data/repository
#+END_SRC

** RAMADDA Configuration

When you fire up RAMADDA for the very first time, your will have to have a =password.properties= file in the RAMADDA home directory which is =/data/repository/=. See [[http://ramadda.org//repository/userguide/toc.html][RAMADDA documentation]] for more details on setting up RAMADDA.

#+BEGIN_SRC sh :results silent
  echo ramadda.install.password=changeme! > /data/repository/pw.properties
#+END_SRC

** Ports 

Make sure these ports are open on the VM where you are doing this work. Ask the cloud administrator for these ports to be open.

|---------+---------------|
| Service | External Port |
|---------+---------------|
| HTTP    |            80 |
| TDS     |          8080 |
| RAMADDA |          8081 |
| SSL TDM |          8443 |
| LDM     |           388 |
|---------+---------------|

** Tomcat Logging for TDS and RAMADDA

It is a good idea to mount Tomcat logging directories outside the container so that they can be managed for both the TDS and RAMADDA.

#+BEGIN_SRC sh :results silent
  mkdir -p ~/logs/ramadda-tomcat
  mkdir -p ~/logs/tds-tomcat
#+END_SRC

Note that there is also a logging directory in =~/tdsconfig/logs=. That should be looked at periodically.

