ams2016/README/README.tex

\subsection*{Setting up the Data Volumes for the LDM and RAMADDA}
\label{sec:orgheadline11}

The \texttt{/mnt} volume on Azure is a good place to store data. I do not know what kind of assurances Azure makes about the reliability of storing your data there for the long term. (I remember reading about this once, but I cannot remember where.) For the LDM this should not be too much of a problem, but for RAMADDA you may wish to be careful.

\begin{verbatim}
df -H
\end{verbatim}

\begin{center}
\begin{tabular}{llrllll}
Filesystem & Size & Used & Avail & Use\% & Mounted & on\\
/dev/sda1 & 31G & 1.8G & 28G & 6\% & / & \\
none & 4.1k & 0 & 4.1k & 0\% & /sys/fs/cgroup & \\
udev & 7.4G & 13k & 7.4G & 1\% & /dev & \\
tmpfs & 1.5G & 394k & 1.5G & 1\% & /run & \\
none & 5.3M & 0 & 5.3M & 0\% & /run/lock & \\
none & 7.4G & 0 & 7.4G & 0\% & /run/shm & \\
none & 105M & 0 & 105M & 0\% & /run/user & \\
none & 66k & 0 & 66k & 0\% & /etc/network/interfaces.dynamic.d & \\
/dev/sdb1 & 640G & 73M & 607G & 1\% & /mnt & \\
\end{tabular}
\end{center}

Create a \texttt{/data} directory where the LDM and RAMADDA data will live. 

For the LDM:

\begin{verbatim}
sudo ln -s /mnt /data
sudo mkdir /mnt/ldm/
sudo chown -R ubuntu:docker /data/ldm
\end{verbatim}

Create a \texttt{/repository} directory where the RAMADDA data will live.

\begin{verbatim}
sudo mkdir /mnt/repository/
sudo chown -R ubuntu:docker /data/repository
\end{verbatim}

\subsection*{RAMADDA Configuration}
\label{sec:orgheadline12}

When you fire up RAMADDA for the very first time, your will have to have a \texttt{password.properties} file in the RAMADDA home directory which is \texttt{/data/repository/}. See \href{http://ramadda.org//repository/userguide/toc.html}{RAMADDA documentation} for more details on setting up RAMADDA.

\begin{verbatim}
echo ramadda.install.password=changeme! > /data/repository/pw.properties
\end{verbatim}

\subsection*{Ports}
\label{sec:orgheadline13}

Make sure these ports are open on the VM where you are doing this work. Ask the cloud administrator for these ports to be open.

\begin{center}
\begin{tabular}{lr}
\hline
Service & External Port\\
\hline
HTTP & 80\\
TDS & 8080\\
RAMADDA & 8081\\
SSL TDM & 8443\\
LDM & 388\\
\hline
\end{tabular}
\end{center}

\subsection*{Tomcat Logging for TDS and RAMADDA}
\label{sec:orgheadline14}

It is a good idea to mount Tomcat logging directories outside the container so that they can be managed for both the TDS and RAMADDA.

\begin{verbatim}
mkdir -p ~/logs/ramadda-tomcat
mkdir -p ~/logs/tds-tomcat
\end{verbatim}

Note that there is also a logging directory in \texttt{\textasciitilde{}/tdsconfig/logs}. That should be looked at periodically.
