ams2016/README/README.org
** Fire Up the LDM TDS RAMADDA TDM

Edit the =docker-compose.yml= file and change the =TDM_PW= to =MeIndexer=.

#+BEGIN_SRC emacs-lisp :exports none :results silent :noweb yes
  ;; search for the buffer called docker-compose.yml in your emacs session
  (find-file "/ubuntu@<<myvm>>:/home/ubuntu/git/Unidata-Dockerfiles/ams2016/docker-compose.yml")
#+END_SRC

At this point you are almost ready to run the whole kit and caboodle. But first  pull the relevant docker images to make life easier for the subequent =docker-compose= command.

# Run this command directly on remote host; it takes too long.

#+BEGIN_SRC sh :results silent :eval no
  docker pull unidata/ldmtds:latest
  docker pull unidata/tdm:latest
  docker pull unidata/tds:latest
  docker pull unidata/ramadda:latest
#+END_SRC

At this point you can run 

#+BEGIN_SRC sh :results silent
  docker-compose -f ~/git/Unidata-Dockerfiles/ams2016/docker-compose.yml up -d
#+END_SRC

** Check What You Have Setup

At this point you have these services running:

- LDM
- TDS
- TDM
- RAMADDA

Verify you have the TDS running by navigating to:

#+BEGIN_SRC emacs-lisp :noweb yes :results raw :exports results
  (format "[[http://<<myvm>>.cloudapp.net/thredds/catalog.html]]")
#+END_SRC

#+RESULTS:
[[http://unidata-server.cloudapp.net/thredds/catalog.html]]

Verify you have the RAMADDA running by navigating to:

#+BEGIN_SRC emacs-lisp :noweb yes :results raw :exports results
  (format "[[http://<<myvm>>.cloudapp.net:8081/repository]]")
#+END_SRC

#+RESULTS:
[[http://unidata-server.cloudapp.net:8081/repository]]

If you are going to RAMADDA for the first time, you will have to do some [[http://ramadda.org//repository/userguide/toc.html][RAMADDA set up]].

Also RAMADDA has access to the =/data/ldm= directory so you may wish to set up [[http://ramadda.org//repository/userguide/developer/filesystem.html][server-side view of this part of the file system]].
