ams2016/README/README.tex

\subsection*{Fire Up the LDM TDS RAMADDA TDM}
\label{sec:orgheadline15}

Edit the \texttt{docker-compose.yml} file and change the \texttt{TDM\_PW} to \texttt{MeIndexer}.

At this point you are almost ready to run the whole kit and caboodle. But first  pull the relevant docker images to make life easier for the subequent \texttt{docker-compose} command.


\begin{verbatim}
docker pull unidata/ldmtds:latest
docker pull unidata/tdm:latest
docker pull unidata/tds:latest
docker pull unidata/ramadda:latest
\end{verbatim}

At this point you can run 

\begin{verbatim}
docker-compose -f ~/git/Unidata-Dockerfiles/ams2016/docker-compose.yml up -d
\end{verbatim}

\subsection*{Check What You Have Setup}
\label{sec:orgheadline16}

At this point you have these services running:

\begin{itemize}
\item LDM
\item TDS
\item TDM
\item RAMADDA
\end{itemize}

Verify you have the TDS running by navigating to:

\url{http://unidata-server.cloudapp.net/thredds/catalog.html}

Verify you have the RAMADDA running by navigating to:

\url{http://unidata-server.cloudapp.net:8081/repository}

If you are going to RAMADDA for the first time, you will have to do some \href{http://ramadda.org//repository/userguide/toc.html}{RAMADDA set up}.

Also RAMADDA has access to the \texttt{/data/ldm} directory so you may wish to set up \href{http://ramadda.org//repository/userguide/developer/filesystem.html}{server-side view of this part of the file system}.
\end{document}
