ams2016/README/README.md

## Fire Up the LDM TDS RAMADDA TDM<a id="orgheadline15"></a>

Edit the `docker-compose.yml` file and change the `TDM_PW` to `MeIndexer`.

At this point you are almost ready to run the whole kit and caboodle. But first  pull the relevant docker images to make life easier for the subequent `docker-compose` command.

    docker pull unidata/ldmtds:latest
    docker pull unidata/tdm:latest
    docker pull unidata/tds:latest
    docker pull unidata/ramadda:latest

At this point you can run 

    docker-compose -f ~/git/Unidata-Dockerfiles/ams2016/docker-compose.yml up -d

## Check What You Have Setup<a id="orgheadline16"></a>

At this point you have these services running:

-   LDM
-   TDS
-   TDM
-   RAMADDA

Verify you have the TDS running by navigating to:

<http://unidata-server.cloudapp.net/thredds/catalog.html>

Verify you have the RAMADDA running by navigating to:

<http://unidata-server.cloudapp.net:8081/repository>

If you are going to RAMADDA for the first time, you will have to do some [RAMADDA set up](http://ramadda.org//repository/userguide/toc.html).

Also RAMADDA has access to the `/data/ldm` directory so you may wish to set up [server-side view of this part of the file system](http://ramadda.org//repository/userguide/developer/filesystem.html).
